## PANDAS ASSIGNMENT

***

### Qn.1. How-to-count-the-distance-to-the-previous-zero

#### For each value, count the difference of the distance from the previous zero(or the start of the Series, whichever is closer) and if there are no previous zeros, print the position
#### Consider a DataFrame df where there is an integer column{'X':[7,2,0,3,4,2,5,0,3,4]}
#### The values should therefore be [1,2,0,1,2,3,4,0,1,2]. Make this a new column 'Y'/

In [1]:
import numpy as np
import pandas as pd

In [2]:
df=pd.DataFrame({'X':[7,2,0,3,4,2,5,0,3,4]})

In [3]:
df

   X
0  7
1  2
2  0
3  3
4  4
5  2
6  5
7  0
8  3
9  4

In [4]:
#Counting the distance to the previous zero

X=[7,2,0,3,4,2,5,0,3,4]

count=1
Y=[]
for items in X:
    if items==0:
        count=0
    
    Y.append(count)
    count+=1
print('Y = ',Y)

Y =  [1, 2, 0, 1, 2, 3, 4, 0, 1, 2]

In [5]:
df=pd.DataFrame({'X':[7,2,0,3,4,2,5,0,3,4],'Y':[1, 2, 0, 1, 2, 3, 4, 0, 1, 2]})

In [6]:
df

   X  Y
0  7  1
1  2  2
2  0  0
3  3  1
4  4  2
5  2  3
6  5  4
7  0  0
8  3  1
9  4  2

### Qn.2. Create a Datetimeindex that contains each business day of 2015 and use it to index a Series of random numbers

In [138]:
DtIndex = pd.date_range('2015-01-01', '2015-12-31',freq='B')  #freq='B' stands for 'Business day' starting from 1st Jan to 31st Dec of 2015

In [139]:
DtIndex #this is the datatimeindex which contains each business day of 2015 and it has 261 days

DatetimeIndex(['2015-01-01', '2015-01-02', '2015-01-05', '2015-01-06',
               '2015-01-07', '2015-01-08', '2015-01-09', '2015-01-12',
               '2015-01-13', '2015-01-14',
               ...
               '2015-12-18', '2015-12-21', '2015-12-22', '2015-12-23',
               '2015-12-24', '2015-12-25', '2015-12-28', '2015-12-29',
               '2015-12-30', '2015-12-31'],
              dtype='datetime64[ns]', length=261, freq='B')

In [66]:
#making s as the series of random numbers and using my DatetimeIndex to index s

In [140]:
s=pd.Series(np.random.rand(261),index=DtIndex)

In [110]:
s.head(10)   #created a DatetimeIndex that contains each businessday of 2015 and that has been used to index to a series of random numbers

2015-01-01    0.195803
2015-01-02    0.430747
2015-01-05    0.765288
2015-01-06    0.067618
2015-01-07    0.771261
2015-01-08    0.838854
2015-01-09    0.093926
2015-01-12    0.136179
2015-01-13    0.675941
2015-01-14    0.368311
Freq: B, dtype: float64

In [141]:
Businessdays_2015=pd.DataFrame(data = s, index= DtIndex)

#Created a dataframe with datetimeIndex as 'index' and 's' as attribute

In [70]:
Businessdays_2015.columns=['s']        #naming column as 's'

In [71]:
Businessdays_2015.head()              #my dataframe is Businessdays_2015 which has 's' as column

                   s
2015-01-01  0.195803
2015-01-02  0.430747
2015-01-05  0.765288
2015-01-06  0.067618
2015-01-07  0.771261

In [72]:
Businessdays_2015.shape

(261, 1)

### Qn.3 Find the sum of the values in s for every Wednesday

In [73]:
#I have created the dataframe Businessdays_2015 with attribute 's'. So taking sum of all wednesdays in 2015 from Businessdays_2015

In [74]:
Businessdays_2015.head()

                   s
2015-01-01  0.195803
2015-01-02  0.430747
2015-01-05  0.765288
2015-01-06  0.067618
2015-01-07  0.771261

In [116]:
Businessdays_2015['Day']=DatetimeIndex.day_name() #creating a column for showing the corresponding days for the date

In [117]:
Businessdays_2015.head(7)

                   s        Day
2015-01-01  0.195803   Thursday
2015-01-02  0.430747     Friday
2015-01-05  0.765288     Monday
2015-01-06  0.067618    Tuesday
2015-01-07  0.771261  Wednesday
2015-01-08  0.838854   Thursday
2015-01-09  0.093926     Friday

In [121]:
Businessdays_2015.groupby(['Day']).sum()

                   s
Day
Friday     28.164682
Monday     24.284494
Thursday   23.126041
Tuesday    28.517767
Wednesday  25.037836

In [96]:
#Another method for finding the sum of s for all Wednesday

In [124]:
sum_of_s=Businessdays_2015[Businessdays_2015.Day=="Wednesday"].s.sum()

In [125]:
print("sum_of_s= ",sum_of_s)

sum_of_s=  25.03783576024209

### Qn.3.Average for each calendar month

In [137]:
Businessdays_2015.resample('M').mean() #finding the average for each month in 2015

                   s
2015-01-31  0.479904
2015-02-28  0.505845
2015-03-31  0.525823
2015-04-30  0.410354
2015-05-31  0.435024
2015-06-30  0.550255
2015-07-31  0.484319
2015-08-31  0.417652
2015-09-30  0.558888
2015-10-31  0.563337
2015-11-30  0.425364
2015-12-31  0.569017

### Qn.5. For each group of four consecutive calendar months in s, find the date on which the highest value occurred

In [135]:
Businessdays_2015.groupby(pd.Grouper(freq='4M')).max() #finding date on which s was highest for 4 months

                   s        Day
2015-01-31  0.882172  Wednesday
2015-05-31  0.988071  Wednesday
2015-09-30  0.993780  Wednesday
2016-01-31  0.990965  Wednesday